app/controllers/posts_controller.rb

  def posts
    @post = Post.all
---
SELECT "posts".* FROM "posts"